{"cells":[{"cell_type":"markdown","id":"518aff5f-c0c5-44d8-8524-92254a5add96","metadata":{"id":"518aff5f-c0c5-44d8-8524-92254a5add96"},"source":["### TP2 : Accès aux données Sémantiques via SPARQL\n","\n","\t\t\tK. Todorov et G. Sanou"]},{"cell_type":"markdown","id":"d3ce166d-e482-4303-b3bb-b51670adaf17","metadata":{"id":"d3ce166d-e482-4303-b3bb-b51670adaf17"},"source":["- Lister  20 mAbs qui sont des INN\n","- Lister  20 mAbs ainsi que leur cibles\n","- Lister 10  mAbs et les indications cliniques associées\n","- Lister 20 mAbs qui sont associées à un mode d’action\n","- Associer 30 mAbs avec leur produit d’étude\n","- Rechercher des mAbs en utilisant leur nom INN, avec la propriété imgt:inn_name\n","- Suivant la même procédure rechercher les mAb avec les noms suivants: belimumab, oxelumab, relatlimab.\n","- Pour les mêmes mAbs de la question a), associé les à leur construction ainsi que les connaissances de la construction et aussi à leur cible\n","- Pour les même mAbs de la question a), associé leur au produit, et toutes les connaissances du produit jusqu’à phases cliniques.\n","- Reproduiser le graphe des instances de la figure pour le relatlimab\n","- Afficher tous les mAbs indiqué (imgt:hasClinicalIndication) dans le traitement des tumeurs solides (imgt:Solid_tumors)\n","- Lister les mAbs qui sont en phase 3 et M\n"]},{"cell_type":"code","execution_count":4,"id":"12301a65-1523-4569-b671-e3f47c6b739b","metadata":{"id":"12301a65-1523-4569-b671-e3f47c6b739b","executionInfo":{"status":"ok","timestamp":1738698223063,"user_tz":-60,"elapsed":644,"user":{"displayName":"Gaoussou SANOU","userId":"06936333377910156800"}}},"outputs":[],"source":["from SPARQLWrapper import SPARQLWrapper, JSON, CSV\n","\n","prefix = \"\"\"\n","PREFIX owl: <http://www.w3.org/2002/07/owl#>\n","PREFIX faldo: <http://biohackathon.org/resource/faldo#>\n","PREFIX obo: <http://purl.obolibrary.org/obo/>\n","PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n","PREFIX ncit: <http://ncicb.nci.nih.gov/xml/owl/EVS/Thesaurus.owl#>\n","PREFIX imgt: <https://www.imgt.org/imgt-ontology#>\n","PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n","PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n","PREFIX bao: <http://www.bioassayontology.org/bao#>\n","\"\"\"\n","sparql = SPARQLWrapper(\"https://www.imgt.org/fuseki/MabkgKg/sparql\")\n","sparql.setReturnFormat(JSON)\n","#%reload_ext lab_black"]},{"cell_type":"code","source":["!pip install SPARQLWrapper rdflib"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"MHHRSrycfLRg","executionInfo":{"status":"ok","timestamp":1738698198943,"user_tz":-60,"elapsed":5308,"user":{"displayName":"Gaoussou SANOU","userId":"06936333377910156800"}},"outputId":"d96b2eb3-f2ec-4412-ffb6-e0b2dca2e4f6"},"id":"MHHRSrycfLRg","execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Collecting SPARQLWrapper\n","  Downloading SPARQLWrapper-2.0.0-py3-none-any.whl.metadata (2.0 kB)\n","Collecting rdflib\n","  Downloading rdflib-7.1.3-py3-none-any.whl.metadata (11 kB)\n","Requirement already satisfied: pyparsing<4,>=2.1.0 in /usr/local/lib/python3.11/dist-packages (from rdflib) (3.2.1)\n","Downloading SPARQLWrapper-2.0.0-py3-none-any.whl (28 kB)\n","Downloading rdflib-7.1.3-py3-none-any.whl (564 kB)\n","\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m564.9/564.9 kB\u001b[0m \u001b[31m20.0 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n","\u001b[?25hInstalling collected packages: rdflib, SPARQLWrapper\n","Successfully installed SPARQLWrapper-2.0.0 rdflib-7.1.3\n"]}]},{"cell_type":"code","execution_count":5,"id":"d56d8ac8-6e84-4e19-bfed-a83744ca150c","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"d56d8ac8-6e84-4e19-bfed-a83744ca150c","executionInfo":{"status":"ok","timestamp":1738698232296,"user_tz":-60,"elapsed":342,"user":{"displayName":"Gaoussou SANOU","userId":"06936333377910156800"}},"outputId":"a34f8d5b-c79b-4957-ee0c-9939a1741bb8"},"outputs":[{"output_type":"stream","name":"stdout","text":["https://www.imgt.org/imgt-ontology#mAb_1372\n","https://www.imgt.org/imgt-ontology#mAb_1196\n","https://www.imgt.org/imgt-ontology#mAb_961\n","https://www.imgt.org/imgt-ontology#mAb_785\n","https://www.imgt.org/imgt-ontology#mAb_1247\n","https://www.imgt.org/imgt-ontology#mAb_158\n","https://www.imgt.org/imgt-ontology#mAb_1477\n","https://www.imgt.org/imgt-ontology#mAb_1128\n","https://www.imgt.org/imgt-ontology#mAb_1150\n","https://www.imgt.org/imgt-ontology#mAb_782\n","https://www.imgt.org/imgt-ontology#mAb_1528\n","https://www.imgt.org/imgt-ontology#mAb_570\n","https://www.imgt.org/imgt-ontology#mAb_468\n","https://www.imgt.org/imgt-ontology#mAb_172\n","https://www.imgt.org/imgt-ontology#mAb_165\n","https://www.imgt.org/imgt-ontology#mAb_175\n","https://www.imgt.org/imgt-ontology#mAb_414\n","https://www.imgt.org/imgt-ontology#mAb_517\n","https://www.imgt.org/imgt-ontology#mAb_790\n","https://www.imgt.org/imgt-ontology#mAb_242\n"]}],"source":["## Lister  20 mAbs qui sont des INN\n","sparql.setQuery(\n","    prefix\n","    + \"\"\"\n","SELECT * WHERE {\n","  ?mAb a imgt:INN\n","} LIMIT 20\n","    \"\"\"\n",")\n","\n","try:\n","    ret = sparql.queryAndConvert()\n","    for r in ret[\"results\"][\"bindings\"]:\n","        print(r[\"mAb\"][\"value\"])\n","except Exception as e:\n","    print(e)"]},{"cell_type":"code","source":["from SPARQLWrapper import SPARQLWrapper, JSON\n","\n","# Set up the endpoint\n","endpoint_url = \"https://www.imgt.org/fuseki/MabkgKg/sparql\"\n","sparql = SPARQLWrapper(endpoint_url)\n","\n","# Example query - Triple count\n","query = \"\"\"\n","SELECT (COUNT(*) AS ?triples) WHERE {\n","    ?s ?p ?o\n","}\n","\"\"\"\n","\n","sparql.setQuery(query)\n","sparql.setReturnFormat(JSON)\n","results = sparql.query().convert()\n","\n","# Print results\n","for result in results[\"results\"][\"bindings\"]:\n","    print(f\"Total triples: {result['triples']['value']}\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"rmLQvb9ZgHzX","executionInfo":{"status":"ok","timestamp":1738699006534,"user_tz":-60,"elapsed":1076,"user":{"displayName":"Gaoussou SANOU","userId":"06936333377910156800"}},"outputId":"b685cc1a-9023-4ea2-c976-f687b874ce64"},"id":"rmLQvb9ZgHzX","execution_count":9,"outputs":[{"output_type":"stream","name":"stdout","text":["Total triples: 804251\n"]}]},{"cell_type":"code","execution_count":null,"id":"bb9c2826-1e03-4628-87fd-f74abe0562e6","metadata":{"id":"bb9c2826-1e03-4628-87fd-f74abe0562e6","outputId":"1f86d9be-af6b-453f-8f0d-de03d97af580"},"outputs":[{"name":"stdout","output_type":"stream","text":["https://www.imgt.org/imgt-ontology#mAb_684 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:4263\n","https://www.imgt.org/imgt-ontology#mAb_266 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:11929\n","https://www.imgt.org/imgt-ontology#mAb_645 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:3236\n","https://www.imgt.org/imgt-ontology#mAb_772 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:23503\n","https://www.imgt.org/imgt-ontology#mAb_1351 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:1765\n","https://www.imgt.org/imgt-ontology#mAb_559 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:11530\n","https://www.imgt.org/imgt-ontology#mAb_354 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:11934\n","https://www.imgt.org/imgt-ontology#mAb_1043 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:13700\n","https://www.imgt.org/imgt-ontology#mAb_1043 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:5965\n","https://www.imgt.org/imgt-ontology#mAb_860 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:5999\n","https://www.imgt.org/imgt-ontology#mAb_93 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:5522\n","https://www.imgt.org/imgt-ontology#mAb_647 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:3680\n","https://www.imgt.org/imgt-ontology#mAb_1226 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:11763\n","https://www.imgt.org/imgt-ontology#mAb_367 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:2434\n","https://www.imgt.org/imgt-ontology#mAb_442 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:1606\n","https://www.imgt.org/imgt-ontology#mAb_229 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:7508\n","https://www.imgt.org/imgt-ontology#mAb_1131 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:1682\n","https://www.imgt.org/imgt-ontology#mAb_735 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:3430\n","https://www.imgt.org/imgt-ontology#mAb_1314 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:3551\n","https://www.imgt.org/imgt-ontology#mAb_1314 --> https://www.genenames.org/data/gene-symbol-report/#!/hgnc_id/HGNC:3528\n"]}],"source":["## Lister  20 mAbs ainsi que leur cibles\n","sparql.setQuery(\n","    prefix\n","    + \"\"\"\n","SELECT * WHERE {\n","  ?target imgt:isTargetOf ?mAb\n","} LIMIT 20\n","    \"\"\"\n",")\n","\n","try:\n","    ret = sparql.queryAndConvert()\n","    for r in ret[\"results\"][\"bindings\"]:\n","        print(r[\"mAb\"][\"value\"], \"-->\", r[\"target\"][\"value\"])\n","except Exception as e:\n","    print(e)"]},{"cell_type":"code","execution_count":null,"id":"d866291c-389c-4f55-8676-d31f954fe5ee","metadata":{"id":"d866291c-389c-4f55-8676-d31f954fe5ee","outputId":"a98f10cd-07a5-4ba0-fd92-bdcead34cfaa"},"outputs":[{"name":"stdout","output_type":"stream","text":["https://www.imgt.org/imgt-ontology#mAb_684 --> https://www.imgt.org/imgt-ontology#Growth_hormone_(GH)_deficiency_pediatric\n","https://www.imgt.org/imgt-ontology#mAb_266 --> https://www.imgt.org/imgt-ontology#Systemic_lupus_erythematosus_(SLE)\n","https://www.imgt.org/imgt-ontology#mAb_266 --> https://www.imgt.org/imgt-ontology#Vaculitis\n","https://www.imgt.org/imgt-ontology#mAb_645 --> https://www.imgt.org/imgt-ontology#Glioblastoma_multiforme_(GBM)\n","https://www.imgt.org/imgt-ontology#mAb_645 --> https://www.imgt.org/imgt-ontology#Cancers_squamous\n","https://www.imgt.org/imgt-ontology#mAb_772 --> https://www.imgt.org/imgt-ontology#Cancers_bladder\n","https://www.imgt.org/imgt-ontology#mAb_559 --> https://www.imgt.org/imgt-ontology#Cancers\n","https://www.imgt.org/imgt-ontology#mAb_559 --> https://www.imgt.org/imgt-ontology#Cancers_pancreatic\n","https://www.imgt.org/imgt-ontology#mAb_559 --> https://www.imgt.org/imgt-ontology#Cancers_urothelial_(UC)\n","https://www.imgt.org/imgt-ontology#mAb_559 --> https://www.imgt.org/imgt-ontology#Cancers_breast_triple_negative_(TNBC)_metastatic\n"]}],"source":["## Lister 10  mAbs et les indications cliniques associées\n","sparql.setQuery(\n","    prefix\n","    + \"\"\"\n","SELECT * WHERE {\n","  ?mAb imgt:hasClinicalIndication ?clinicalIndication ;\n","        a imgt:INN.\n","} LIMIT 10\n","    \"\"\"\n",")\n","\n","try:\n","    ret = sparql.queryAndConvert()\n","    for r in ret[\"results\"][\"bindings\"]:\n","        print(r[\"mAb\"][\"value\"], \"-->\", r[\"clinicalIndication\"][\"value\"])\n","except Exception as e:\n","    print(e)"]},{"cell_type":"code","execution_count":null,"id":"075ac473-cba5-4e1d-9fa9-8dfdcee49bae","metadata":{"id":"075ac473-cba5-4e1d-9fa9-8dfdcee49bae","outputId":"e2c0ce6b-b80a-43f7-9a2f-0d59c94a89ef"},"outputs":[{"name":"stdout","output_type":"stream","text":["https://www.imgt.org/imgt-ontology#mAb_757 --> https://www.imgt.org/imgt-ontology#MOA_757_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_781 --> https://www.imgt.org/imgt-ontology#MOA_781_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_180 --> https://www.imgt.org/imgt-ontology#MOA_180_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_969 --> https://www.imgt.org/imgt-ontology#MOA_969_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_968 --> https://www.imgt.org/imgt-ontology#MOA_968_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_1024 --> https://www.imgt.org/imgt-ontology#MOA_1024_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_248 --> https://www.imgt.org/imgt-ontology#MOA_248_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_1204 --> https://www.imgt.org/imgt-ontology#MOA_1204_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_1123 --> https://www.imgt.org/imgt-ontology#MOA_1123_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_1368 --> https://www.imgt.org/imgt-ontology#MOA_1368_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_913 --> https://www.imgt.org/imgt-ontology#MOA_913_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_586 --> https://www.imgt.org/imgt-ontology#MOA_586_immunology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_424 --> https://www.imgt.org/imgt-ontology#MOA_424_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_1093 --> https://www.imgt.org/imgt-ontology#MOA_1093_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_512 --> https://www.imgt.org/imgt-ontology#MOA_512_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_659 --> https://www.imgt.org/imgt-ontology#MOA_659_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_723 --> https://www.imgt.org/imgt-ontology#MOA_723_oncology_agonist\n","https://www.imgt.org/imgt-ontology#mAb_943 --> https://www.imgt.org/imgt-ontology#MOA_943_immunology_neutralizing\n","https://www.imgt.org/imgt-ontology#mAb_849 --> https://www.imgt.org/imgt-ontology#MOA_849_oncology_blocking\n","https://www.imgt.org/imgt-ontology#mAb_934 --> https://www.imgt.org/imgt-ontology#MOA_934_oncology_blocking\n"]}],"source":["## Lister 20 mAbs qui sont associées à un mode d’action\n","sparql.setQuery(\n","    prefix\n","    + \"\"\"\n","SELECT distinct * WHERE {\n","  ?mAb bao:BAO_0000196 ?MOA\n","} LIMIT 20\n","    \"\"\"\n",")\n","\n","try:\n","    ret = sparql.queryAndConvert()\n","    for r in ret[\"results\"][\"bindings\"]:\n","        print(r[\"mAb\"][\"value\"], \"-->\", r[\"MOA\"][\"value\"])\n","except Exception as e:\n","    print(e)"]},{"cell_type":"code","execution_count":null,"id":"e63b342e-ccd3-49fe-9706-95e6eacb834a","metadata":{"id":"e63b342e-ccd3-49fe-9706-95e6eacb834a","outputId":"19d6972d-5ad0-4533-b783-fade1af322f0"},"outputs":[{"name":"stdout","output_type":"stream","text":["https://www.imgt.org/imgt-ontology#mAb_821 --> https://www.imgt.org/imgt-ontology#StudyProduct_Mycenax_Biotech_Inc_Rheumatoid_arthritis_(RA)_821\n","https://www.imgt.org/imgt-ontology#mAb_821 --> https://www.imgt.org/imgt-ontology#StudyProduct_Mycenax_Biotech_Inc_Ankylosing_spondylitis_(AS)_821\n","https://www.imgt.org/imgt-ontology#mAb_240 --> https://www.imgt.org/imgt-ontology#StudyProduct_AstraZeneca_Melanoma_metastatic_240\n","https://www.imgt.org/imgt-ontology#mAb_240 --> https://www.imgt.org/imgt-ontology#StudyProduct_AstraZeneca_Sarcoma_240\n","https://www.imgt.org/imgt-ontology#mAb_446 --> https://www.imgt.org/imgt-ontology#StudyProduct_Acceleron_Pharma_Inc_Muscle_wasting_446\n","https://www.imgt.org/imgt-ontology#mAb_446 --> https://www.imgt.org/imgt-ontology#StudyProduct_Acceleron_Pharma_Inc_Duchenne_muscular_dystrophy_(DMD)_446\n","https://www.imgt.org/imgt-ontology#mAb_1212 --> https://www.imgt.org/imgt-ontology#StudyProduct_Corvus_Pharmaceuticals_Solid_tumors_1212\n","https://www.imgt.org/imgt-ontology#mAb_1212 --> https://www.imgt.org/imgt-ontology#StudyProduct_Corvus_Pharmaceuticals_Severe_acute_respiratory_syndrome_coronavirus_2_(SARS-CoV-2)_infection_(COVID-19)_1212\n","https://www.imgt.org/imgt-ontology#mAb_266 --> https://www.imgt.org/imgt-ontology#StudyProduct_GlaxoSmithKline_Systemic_lupus_erythematosus_(SLE)_266\n","https://www.imgt.org/imgt-ontology#mAb_266 --> https://www.imgt.org/imgt-ontology#StudyProduct_GlaxoSmithKline_Vaculitis_266\n","https://www.imgt.org/imgt-ontology#mAb_266 --> https://www.imgt.org/imgt-ontology#StudyProduct_Human_Genome_Sciences_Inc_(HGSI)_Systemic_lupus_erythematosus_(SLE)_266\n","https://www.imgt.org/imgt-ontology#mAb_266 --> https://www.imgt.org/imgt-ontology#StudyProduct_Human_Genome_Sciences_Inc_(HGSI)_Vaculitis_266\n","https://www.imgt.org/imgt-ontology#mAb_325 --> https://www.imgt.org/imgt-ontology#StudyProduct_Roche_F_Hoffmann-La_Roche_Ltd_Idiopathic_pulmonary_fibrosis_325\n","https://www.imgt.org/imgt-ontology#mAb_325 --> https://www.imgt.org/imgt-ontology#StudyProduct_Roche_F_Hoffmann-La_Roche_Ltd_Asthma_325\n","https://www.imgt.org/imgt-ontology#mAb_388 --> https://www.imgt.org/imgt-ontology#StudyProduct_Acceleron_Pharma_Inc_Multiple_myeloma_(MM)_388\n","https://www.imgt.org/imgt-ontology#mAb_388 --> https://www.imgt.org/imgt-ontology#StudyProduct_Acceleron_Pharma_Inc_Solid_tumors_388\n","https://www.imgt.org/imgt-ontology#mAb_324 --> https://www.imgt.org/imgt-ontology#StudyProduct_Takeda_Pharmaceutical_Co_Ltd_Anaplastic_large_cell_lymphoma_(ALCL)_324\n","https://www.imgt.org/imgt-ontology#mAb_324 --> https://www.imgt.org/imgt-ontology#StudyProduct_Takeda_Pharmaceutical_Co_Ltd_Lymphoma_cutaneous_T_cell_(CTCL)_324\n","https://www.imgt.org/imgt-ontology#mAb_324 --> https://www.imgt.org/imgt-ontology#StudyProduct_Takeda_Pharmaceutical_Co_Ltd_T_cell_lymphoma_324\n","https://www.imgt.org/imgt-ontology#mAb_324 --> https://www.imgt.org/imgt-ontology#StudyProduct_Takeda_Pharmaceutical_Co_Ltd_Extranodal_NK/T-cell_lymphoma_(ENKTL)_324\n"]}],"source":["## Associer 30 mAbs avec leur produit d’étude\n","sparql.setQuery(\n","    prefix\n","    + \"\"\"\n","SELECT distinct * WHERE {\n","  ?mAb imgt:hasProduct ?product .\n","  ?product imgt:hasStudyProduct ?study\n","} LIMIT 20\n","    \"\"\"\n",")\n","\n","try:\n","    ret = sparql.queryAndConvert()\n","    for r in ret[\"results\"][\"bindings\"]:\n","        print(r[\"mAb\"][\"value\"], \"-->\", r[\"study\"][\"value\"])\n","except Exception as e:\n","    print(e)"]},{"cell_type":"code","execution_count":null,"id":"99d06207-2185-4504-af89-3b5d4ce05ea1","metadata":{"id":"99d06207-2185-4504-af89-3b5d4ce05ea1","outputId":"9ef7c2a1-a53f-4c1f-e061-e3298ecef9c2"},"outputs":[{"name":"stdout","output_type":"stream","text":["https://www.imgt.org/imgt-ontology#mAb_266 --> belimumab\n","https://www.imgt.org/imgt-ontology#mAb_354 --> oxelumab\n","https://www.imgt.org/imgt-ontology#mAb_229 --> yttrium (90Y) clivatuzumab tetraxetan\n","https://www.imgt.org/imgt-ontology#mAb_530 --> asunercept\n","https://www.imgt.org/imgt-ontology#mAb_317 --> enlimomab pegol\n","https://www.imgt.org/imgt-ontology#mAb_405 --> solitomab\n","https://www.imgt.org/imgt-ontology#mAb_1092 --> dafsolimab setaritox\n","https://www.imgt.org/imgt-ontology#mAb_1180 --> anumigilimab\n","https://www.imgt.org/imgt-ontology#mAb_781 --> relatlimab\n","https://www.imgt.org/imgt-ontology#mAb_568 --> dinutuximab beta\n","https://www.imgt.org/imgt-ontology#mAb_1055 --> emerfetamab\n","https://www.imgt.org/imgt-ontology#mAb_656 --> aprutumab ixadotin\n","https://www.imgt.org/imgt-ontology#mAb_1143 --> runimotamab\n","https://www.imgt.org/imgt-ontology#mAb_744 --> froniglutide\n","https://www.imgt.org/imgt-ontology#mAb_1231 --> motacabtagene lurevgedleucel\n","https://www.imgt.org/imgt-ontology#mAb_1018 --> miromavimab\n","https://www.imgt.org/imgt-ontology#mAb_832 --> lirentelimab\n","https://www.imgt.org/imgt-ontology#mAb_619 --> birtamimab\n","https://www.imgt.org/imgt-ontology#mAb_1106 --> cilgavimab\n","https://www.imgt.org/imgt-ontology#mAb_71 --> siplizumab\n"]}],"source":["## Rechercher des mAbs en utilisant leur nom INN, avec la propriété imgt:inn_name\n","sparql.setQuery(\n","    prefix\n","    + \"\"\"\n","SELECT distinct * WHERE {\n","  ?mAb imgt:inn_name ?inn_name .\n","} LIMIT 20\n","    \"\"\"\n",")\n","\n","try:\n","    ret = sparql.queryAndConvert()\n","    for r in ret[\"results\"][\"bindings\"]:\n","        print(r[\"mAb\"][\"value\"], \"-->\", r[\"inn_name\"][\"value\"])\n","except Exception as e:\n","    print(e)"]},{"cell_type":"code","execution_count":null,"id":"69d225fd-de0f-4e18-9bea-f47a210b4647","metadata":{"id":"69d225fd-de0f-4e18-9bea-f47a210b4647","outputId":"f51f0ced-4597-4929-feb2-1758e50b64db"},"outputs":[{"name":"stdout","output_type":"stream","text":["https://www.imgt.org/imgt-ontology#mAb_266 --> belimumab\n","https://www.imgt.org/imgt-ontology#mAb_354 --> oxelumab\n","https://www.imgt.org/imgt-ontology#mAb_781 --> relatlimab\n"]}],"source":["## Suivant la même procédure rechercher les mAb avec les noms suivants: belimumab, oxelumab, relatlimab.\n","sparql.setQuery(\n","    prefix\n","    + \"\"\"\n","SELECT distinct * WHERE {\n","  ?mAb imgt:inn_name ?inn_name .\n","  Filter (Contains(?inn_name,\"belimumab\") || Contains(?inn_name,\"oxelumab\")|| Contains(?inn_name,\"relatlimab\"))\n","} LIMIT 20\n","\n","    \"\"\"\n",")\n","\n","try:\n","    ret = sparql.queryAndConvert()\n","    for r in ret[\"results\"][\"bindings\"]:\n","        print(r[\"mAb\"][\"value\"], \"-->\", r[\"inn_name\"][\"value\"])\n","except Exception as e:\n","    print(e)"]},{"cell_type":"code","execution_count":null,"id":"b1e22665-fbd4-48a8-aeda-b24ccd0ed8d6","metadata":{"id":"b1e22665-fbd4-48a8-aeda-b24ccd0ed8d6","outputId":"aa87fe84-c11b-472d-b61b-5113df478987"},"outputs":[{"name":"stdout","output_type":"stream","text":["https://www.imgt.org/imgt-ontology#mAb_266 --> belimumab --> https://www.imgt.org/imgt-ontology#Construct_266 --> https://www.imgt.org/imgt-ontology#Segment_266_1 --> https://www.imgt.org/imgt-ontology#IgG1-lambda2 --> https://www.imgt.org/imgt-ontology#IgG1%20-%20lambda\n","https://www.imgt.org/imgt-ontology#mAb_354 --> oxelumab --> https://www.imgt.org/imgt-ontology#Construct_354 --> https://www.imgt.org/imgt-ontology#Segment_354_1 --> https://www.imgt.org/imgt-ontology#IgG1-kappa --> https://www.imgt.org/imgt-ontology#IgG1%20-%20kappa\n","https://www.imgt.org/imgt-ontology#mAb_781 --> relatlimab --> https://www.imgt.org/imgt-ontology#Construct_781 --> https://www.imgt.org/imgt-ontology#Segment_781_1 --> https://www.imgt.org/imgt-ontology#IgG4-kappa --> https://www.imgt.org/imgt-ontology#IgG4%20-%20kappa\n"]}],"source":["## Pour les mêmes mAbs de la question a), associé les à leur construction ainsi que les connaissances de la construction et aussi à leur cible\n","sparql.setQuery(\n","    prefix\n","    + \"\"\"\n","SELECT distinct * WHERE {\n","  ?mAb imgt:inn_name ?inn_name ;\n","       imgt:hasConstruct ?construct.\n","    ?construct   obo:BFO_0000051 ?segment;\n","                imgt:hasImgtLabel ?imgtlabel;\n","                imgt:hasReceptorFormat ?receptformat\n","  Filter (Contains(?inn_name,\"belimumab\") || Contains(?inn_name,\"oxelumab\")|| Contains(?inn_name,\"relatlimab\"))\n","} LIMIT 20\n","\n","    \"\"\"\n",")\n","\n","try:\n","    ret = sparql.queryAndConvert()\n","    for r in ret[\"results\"][\"bindings\"]:\n","        print(\n","            r[\"mAb\"][\"value\"],\n","            \"-->\",\n","            r[\"inn_name\"][\"value\"],\n","            \"-->\",\n","            r[\"construct\"][\"value\"],\n","            \"-->\",\n","            r[\"segment\"][\"value\"],\n","            \"-->\",\n","            r[\"imgtlabel\"][\"value\"],\n","            \"-->\",\n","            r[\"receptformat\"][\"value\"],\n","        )\n","except Exception as e:\n","    print(e)"]},{"cell_type":"code","execution_count":null,"id":"abcc4b4e-6346-4602-9c5b-18508e756e45","metadata":{"id":"abcc4b4e-6346-4602-9c5b-18508e756e45"},"outputs":[],"source":[]}],"metadata":{"kernelspec":{"display_name":"tpwebsem","language":"python","name":"tpwebsem"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.10.16"},"colab":{"provenance":[]}},"nbformat":4,"nbformat_minor":5}